# data frame

In [1]:
import pandas as pd

In [22]:
import numpy as np

In [4]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,88])

In [5]:
a

Empty DataFrame
Columns: []
Index: []

In [6]:
b

    0
0   1
1   2
2  55
3  40
4  88

In [7]:
type (b)

pandas.core.frame.DataFrame

In [10]:
c=pd.DataFrame([[1,1,1,1,1],[2,2,2,2,2],[3,3,3,3,3],[4,4,4,4,4],[5,5,5,5,5]])

In [11]:
c

   0  1  2  3  4
0  1  1  1  1  1
1  2  2  2  2  2
2  3  3  3  3  3
3  4  4  4  4  4
4  5  5  5  5  5

In [12]:
c.head()

   0  1  2  3  4
0  1  1  1  1  1
1  2  2  2  2  2
2  3  3  3  3  3
3  4  4  4  4  4
4  5  5  5  5  5

In [13]:
c.tail()

   0  1  2  3  4
0  1  1  1  1  1
1  2  2  2  2  2
2  3  3  3  3  3
3  4  4  4  4  4
4  5  5  5  5  5

In [15]:
c.tail(2)

   0  1  2  3  4
3  4  4  4  4  4
4  5  5  5  5  5

In [16]:
c.sample()

   0  1  2  3  4
2  3  3  3  3  3

In [17]:
c.sample(2)

   0  1  2  3  4
2  3  3  3  3  3
0  1  1  1  1  1

In [25]:
c=pd.DataFrame([[1,1,1,1,1],[2,2,np.nan,2,2],[3,3,3,3,3],[4,4,4,4,4],[5,5,5,5,5]],columns=['a','s','d','n','f'])

In [27]:
c

   a  s    d  n  f
0  1  1  1.0  1  1
1  2  2  NaN  2  2
2  3  3  3.0  3  3
3  4  4  4.0  4  4
4  5  5  5.0  5  5

In [28]:
c[['a','d']]

   a    d
0  1  1.0
1  2  NaN
2  3  3.0
3  4  4.0
4  5  5.0

In [29]:
c.shape

(5, 5)

In [30]:
c[['a','d']].head(2)

   a    d
0  1  1.0
1  2  NaN

In [31]:
c['a'].max()

5

In [34]:
c['l']=[0,0,0,0,0]

In [35]:
c

   a  s    d  n  f  new_column  l
0  1  1  1.0  1  1           0  0
1  2  2  NaN  2  2           0  0
2  3  3  3.0  3  3           0  0
3  4  4  4.0  4  4           0  0
4  5  5  5.0  5  5           0  0

In [36]:
c['new_column3']=c['new_column']+c['a']

In [37]:
c

   a  s    d  n  f  new_column  l  new_column3
0  1  1  1.0  1  1           0  0            1
1  2  2  NaN  2  2           0  0            2
2  3  3  3.0  3  3           0  0            3
3  4  4  4.0  4  4           0  0            4
4  5  5  5.0  5  5           0  0            5

In [42]:
a= c['new_column3'] >3

In [43]:
a

0    False
1    False
2    False
3     True
4     True
Name: new_column3, dtype: bool

In [44]:
c[a]

   a  s    d  n  f  new_column  l  new_column3
3  4  4  4.0  4  4           0  0            4
4  5  5  5.0  5  5           0  0            5